{
  "projects": [
    {
      "category": "bach",
      "title": "Theme 4 - Genes and inheritance",
      "description": "The last term of my propadeautic year was all about inheritance and how this worked and the theme project reflected this.\n In pairs we had to make a website that had a page in it containing\n a form where you could put in a genotype for a mother and a genotype for a father and\n then a script that we had to write ourselves calculated all the possible genotypes and fenotypes for a possible baby.\n Then a CGI script would turn the results into a webpage and showcase this to the user.\n To calculate the possibilities and showcase the results we used python scripts with in the last case the cgi module.\n We also had to write two chapters of a scientific report for practice purposes.",
      "id":"theme4",
      "links":[
        {
          "before": "Sadly, the website that I was talking about is only available in dutch,\n but you can take a look at it",
          "src": "http://cv.wendyvandermeulen.com/informatica/thema4/thema4_index.html",
          "text": "here",
          "after": " (opens in a new tab).\n"
        },
        {
          "before": "For the whole project, including code, look at the bitbucket repository I created for the project:\n",
          "src": "https://bitbucket.org/wendy1998/theme-4-genes-and-inheritance/src/master/",
          "text": "Theme 4 Bitbucket",
          "after": "I only created the repository when I wrote this website because it wasn't part of the assignments yet in the first year.\n This means it doesn't have proper commit messages.\n When you look at code, keep in mind that I wrote this in my first year and that my quality of coding has much improved since then."
        }],
      "skills":[
        "Python programming",
        "Working together",
        "CGI skills with python",
        "HTML/CSS",
        "Scientific writing",
        "Making a clear readme"
      ]
    },
    {
      "category": "prof",
      "title": "YMDb - YoungCapital Movie Database",
      "description": "As the final assignment of the Java traineeship of YounCapital,\nme and two others have created a web-application that is based on IMDB.\nOn this web-application, users can search for movies and their ratings and give ratings to them themselves.\nThey can also make lists of movies of what they want to see and what they own.\n                      Next to that, they can leave comments on the movies' pages.\nCritics can make a separate account and leave official reviews for movies.\n                      The front-end was created using the Angular framework and the back-end is a Spring Boot application which uses an MVC approach.",
      "id":"ymdb",
      "links":[
        {
          "before": "The web-application is online ",
          "src": "http://ymdb.nl/",
          "text": "here",
          "after": " (opens in a new tab).\n"
        },
        {
          "before": "",
          "src": "https://github.com/YoungCapital-NEXT-4/ymdb-frontend",
          "text": "Github frontend link",
          "after": " (opens in a new tab).\n"
        },
        {
          "before": "",
          "src": "https://github.com/YoungCapital-NEXT-4/ymdb-backend",
          "text": "Github backend link",
          "after": "(opens in a new tab)."
        }],
      "skills":[
        "Angular",
        "Javascript / Jquery ",
        "Programming in Java",
        "Spring framework",
        "Working in groups",
        "Presentation skills",
        "Agile way of working",
        "Linux deployment using Jenkins",
        "Using Git hooks"
      ]
    },
    {
      "category": "prof",
      "title": "Gauss - Eulor 2.0",
      "description": "As the final assignment of the C#.Net traineeship of YounCapital,\n me and two others have created a web-application with c#.\n                      On this web-application, teachers can make their own assignments and check what\n                      students have answered on them and students can try to answer all the available assignments.\n                      The frontend was made with ASP.NET razor pages, razor code, HTML, CSS and Javascript / Jquery.\n                      During the process of making this assignment,\n                      we used the Scrum way of development including but not limited to sprints and reflections.\n                      We got the chance to deploy the application on a linux server using Jenkins,\n                      but this was put offline after the traineeship finished.",
      "id":"gauss",
      "links":[
        {
          "before": "The web-application spoken about is based on ",
          "src": "https://projecteuler.net/archives",
          "text": "Project Euler",
          "after": " (opens in a new tab).\n"
        },
        {
          "before": "",
          "src": "https://github.com/YoungCapital-NEXT-4/gauss",
          "text": "Github link",
          "after": " (opens in a new tab).\n"
        }],
      "skills":[
        "Razor pages web-development",
        "Programming in c#",
        "Database connectivity / SQL",
        "Javascript / Jquery ",
        "Working in groups",
        "Presentation skills",
        "Agile way of working",
        "Razor syntax",
        "Linux deployment using Jenkins",
        "Using Git hooks"
      ]
    },
    {
      "category": "hon",
      "title": "Masterclass Anthocyanins",
      "description": "For my honours education, I did a literary research project with a student from a different study program (industrial chemistry). This was for a professor of the Hanze University and we had to report to him on our findings. This project was done over the span of half a school year (+/- 5 months) and in this time we noticed how hard it can be to come up with a project, talk about it to a superior and do the research, on top of a bachelor degree program. At first we struggled with how to best use our time and how to report, but along the way, we figured it out. At the beginning of the project, we had to come up with a professional plan of action, and for this we got a guest lecture from the Hanze project department on how to make a good plan of action. We learned to use gant charts and pert charts and how to make working packages and this has been a huge asset for me. At the end of the project, we had to give a presentation of half an hour before the entire school faculty and friends/family about what we did and what we found. As a way of keeping our boss up to date, I made a website with all our findings and the plan of action and time planning. I managed this project, so I had to check if everyone was doing their job and were on time with their results and then I had to communicate them with the boss.",
      "id": "masterclass",
      "links": [
        {
          "before": "The website I was talking about can be found ",
          "src": "http://cv.wendyvandermeulen.com/honours/masterclasses/masterclass_anthocyanen/website/index.html",
          "text": "here",
          "after": ", but sadly this is in dutch and so are all the results. I wanted to do it in english, but our boss wanted it in dutch."
        }
      ],
      "skills":
      [
        "Working together in an interdisciplinary environment",
        "Doing a project for a boss",
        "Making a proper plan of action",
        "Making a gant chart",
        "Making a pert chart",
        "Doing literary research",
        "Scanning through lots of articles for relevance",
        "Creating huge summaries of results",
        "Project management",
        "Managing time over a long timespan",
        "Speaking in front of a big crowd"
      ]
    },
    {
      "category": "hon",
      "title": "RTK protein interaction, practical research",
      "description": "One of the mandatory components of an honours program at my school is to do a practical research project for/with a professor. In my case, this was a project about the configuration of alpha-helices of trans-membrane proteins in membranes. From the professor (Tsjerk Wassenaar, creator of INSANE and DAFT software) I got a huge dataset of coordinates of atoms in two alpha helices on different time points for 20 different proteins. With them I got the interaction energy between those atoms and the membrane, each other and the environment (in this case water). My job was to find out if there was a connection between the interactions and the configurations of the helices, and if so, in which formation and which interaction. Sadly I only had 140 hours for the entire project, from coming up with it until handing in the report, so I wasn't able to get a clear answer to this question. In this project I first learned how to work with pandas, jupyter notebooks and numpy.",
      "id": "RTK",
      "links": [
        {
          "before": "for information on this project, look at the ",
          "src": "http://cv.wendyvandermeulen.com/honours/onderzoek/werk.html",
          "text": "project page",
          "after": "of the honours website (now still dutch, but will be translated in the coming weeks). For easy, I will link the important files on this page too, but only the code is english, the written text is in dutch."
        },
        {
          "before": "Notebook report: ",
          "src": "http://cv.wendyvandermeulen.com/honours/onderzoek/RTK_alphahelix_interacties_in_membranen.ipynb",
          "text": "report notebook",
          "after": " (opens in new tab)."
        },
        {
          "before": "Notebook practical work: ",
          "src": "http://cv.wendyvandermeulen.com/honours/onderzoek/RTK.ipynb",
          "text": "RTK",
          "after": " (opens in new tab)."
        },
        {
          "before": "PDF report: ",
          "src": "http://cv.wendyvandermeulen.com/honours/onderzoek/verslag.pdf",
          "text": "report pdf",
          "after": " (opens in new tab)."
        }
      ],
      "skills": [
        "Working with numpy",
        "Working with pandas",
        "Working with jupyter notebooks",
        "Making 2d and 3d plots with Mathplotlib",
        "Create and analyze Numpy 3d histograms",
        "A little bit of bash programming",
        "Creating a report from a Jupyter Notebook",
        "Working for a superior",
        "Comping up with your own project",
        "Python programming"
      ]
    },
    {
      "category": "hon",
      "title": "Colloquium phylogenetics",
      "description": "A colloquium is a literary research project in which you need to find as much information as you can about a specific topic, chosen by yourself. Or you can answer a research question using literature. My colloquium was about phylogenetics and how the human species came to be. For an in-debt description of what I have done, look at the website that I link to in the other tab.",
      "id": "colloquium",
      "links": [
        {
          "before": "Website about my colloquium: ",
          "src": "http://cv.wendyvandermeulen.com/honours/colloquium/website/index.html",
          "text": "Website",
          "after": " (opens in new tab)."
        }
      ],
      "skills": [
        "Literary research",
        "Scientific writing",
        "Project management",
        "Presenting"
      ]
    },
    {
      "category": "bach",
      "title": "Theme 5 - Diagnostic Genome Analysis",
      "description": "In this theme, we (a pair again) used Galaxy to create a workflow to identify variants in a genome. We looked into the fastq format, read mapping with different mappers and creating pileup data. This part was done by a script we had to write ourselves to practice our python skills, even though there are tools for this. After that we did a variant scan and looked at the found variants with ANNOVAR. The pileup script was eventually added to Galaxy so a pipeline could be created. The variants were added to a database and we used SQL to query this. We also had to practice scientific writing again.",
      "id": "theme5",
      "links": [
        {
          "before": "For this theme it is a bit harder to show the work I have done, because a lot was done in Galaxy and I cannot show you that, but I can show you the scripts we wrote. The scripts we wrote can be found on",
          "src": "https://bitbucket.org/wendy1998/thema-05-diagnosticgenomeanalysis/src/master/",
          "text": "this",
          "after": " bitbucket repository, but that also contains the instructions we got for the theme, so it's not only my course work."
        }
      ],
      "skills": [
        "Python programming",
        "Working together",
        "Working with Galaxy",
        "Variance analysis",
        "Genome quality control",
        "Mapping",
        "Adding tools to galaxy",
        "Database querying with SQL",
        "Scientific writing"
      ]
    },
    {
      "category": "bach",
      "title": "Theme 6 - Metagenomic analysis",
      "description": "In theme 6, a group of 4 persons had to do metagenomic analysis using Galaxy. We got fastq data which was checked for quality, then the data went through an ORF finder program that we wrote ourselves in python and that was then added as a tool to the Galaxy environment. The main focus of this project was for us to learn to understand the many different ways in which data can be processed and how many tools there are for this. The new things we learned was mainly de-novo genome assembly and the amount of mapping programs there is.",
      "id": "theme6",
      "links": [
        {
          "before": "Because almost all of this was done in galaxy, the bitbucket repository for this theme is almost empty, but you can look at it",
          "src": "https://bitbucket.org/wendy1998/diagnostic-metagenomic-analysis/src/master/",
          "text": "here",
          "after": " (opens in new tab)."
        }
      ],
      "skills": [
        "Working in a big group",
        "Python programming",
        "Working with Galaxy",
        "De-novo genome assembly",
        "Finding the best tool for projects"
      ]
    },
    {
      "category": "bach",
      "title": "Theme 7 - Gene expression analysis",
      "description": "Theme 7 was the first theme where we used Rmarkdown in a theme project. I used R code to identify differentially expressed genes in a set of NGS data from mice with maternal asthma. These DEG's were then used to see if they are from specific pathways and what their effects were. I had to redo the research in an article I found through the NCBI database, but I did have to come up with a project proposal, which I will link to in the links department. I had to give a short presentation about the proposal at the beginning of the theme. At the end of this (individual) theme, we had to give a poster flash, like always in the third term of the year. If you were chosen by the teacher, you had to do your flash again in the annual poster presentation session for the entire school. I also had to write (part of) a report again.",
      "id": "theme7",
      "links": [
        {
          "before": "For some reason, I don't have a bitbucket repository for this theme (anymore) and on my own computer, the script I wrote is no where to be found. Luckily, I do still have the pdf from the Rmarkdown file with the scripts shown, but you won't be able to run it. The project proposal can be found  the original study that I did part of can be found  the logbook/scripts can be seen in  the poster used for the final presentation can be found ",
          "src": "http://cv.wendyvandermeulen.com/informatica/thema7/poster.pdf",
          "text": "here",
          "after": " (dutch, opens in new tab)."
        }
      ],
      "skills": [
        "Creating a report with Rmarkdown",
        "Gene expresion analysis",
        "Programming in R",
        "Working with several statistics",
        "Visualizing content in Rmarkdown",
        "Carefully following instructions",
        "Holding a poster flash of at most 1 minute",
        "Working with big data (10ns of thousands of genes)",
        "Scientific writing"
      ]
    },
    {
      "category": "bach",
      "title": "Theme 8 - Modelling systems biology",
      "description": "During theme 8 we got to practice with systems biology and making mathematical models in R. In groups of 2, we first had to do some practice assignments and then in the last 3 weeks of the term, we had to redo the research of an article of our choosing. Me and my group partner modelled the circadian clock process in our body. The mathematical equations we needed were already present in the article (as they should be), so the only thing we needed to do was calculate them through. The main focus of this theme was more writing a report than the actual programming. We learned to write a lot of formulas in Rmarkdown and how to make readable tables with lots of values.",
      "id": "theme8",
      "links": [
        {
          "before": "This is the link to the bitbucket repository containing all the project work: ",
          "src": "https://bitbucket.org/wendy1998/thema08-systemsbiology/src/master/",
          "text": "Theme 8",
          "after": " (opens in new tab)."
        }
      ],
      "skills": [
        "Calculating through mathematical models in R",
        "Creating formulas in Rmarkdown",
        "Creating large tables in Rmarkdown",
        "Scientific writing",
        "R programming",
        "Working together"
      ]
    },
    {
      "category": "bach",
      "title": "Theme 9 - Introduction datamining",
      "description": "This project revolved around different datamining algorithms in Weka. I got data where you had to make a prediction about whether horses got/survived colic disease. We first had to check the data for quality using R. Then I chose to optimize my data for two different schemes and after that I optimized the schemes. When the scheme optimization was done, we had to make a Java wrapper for this scheme with which new data could be predicted. I also had to make a report of this with Rmarkdown. This was an individual project for a change.",
      "id": "theme9",
      "links": [
        {
          "before": "Bitbucket for Java wrapper: ",
          "src": "https://bitbucket.org/wendy1998/thema-9-horce-colic-classifier/src/second/",
          "text": "Java wrapper repo",
          "after": " (opens in new tab)."
        },
        {
          "before": "Bitbucket for datamining part: ",
          "src": "https://bitbucket.org/wendy1998/thema-09-datamining/src/master/",
          "text": "Datamining repo",
          "after": " (opens in new tab)."
        }
      ],
      "skills": [
        "Datamining with Weka",
        "Scientific writing",
        "Java programming"
      ]
    },
    {
      "category": "bach",
      "title": "Theme 10 - Webbased information systems",
      "description": "This project was about building a web-interface where diagnostics students can put in their data from scientific experiments and look at the data they put in during the project. Teachers can use the system to look at what the students put in and their way of thinking. This program can add scientific data to a database that is configured to host the data. It can be used to check on students in teams and what their thoughts are on specific experiments. It can also be used by students to learn to work with a laboratory management system. The database this program uses can store data for multiple years and projects, so it can also be used to get a view of what multiple years of students think of their experiments. In this project, I had to use JavaScript for the first time and I used AJAX calls to update the data on the webpage real-time without refreshing the webpage. Part of a scientific report had also be written again.",
      "id": "theme10",
      "links": [
        {
          "before": "Bitbucket repository: ",
          "src": "https://bitbucket.org/wendy1998/thema-10-web-based-information-systems/src/master/",
          "text": "Theme 10 repo",
          "after": " (opens in new tab)."
        }
      ], "skills": [
      "Java programming",
      "JavaScript programming",
      "Database creation/querying with SQL",
      "Webapp creation with Java/ JSP's",
      "Working with DataTables/AJAX calls",
      "Working for a boss",
      "Creating proper plan of actions",
      "Presenting",
      "Scientific writing"
      ]
    },
    {
      "category": "bach",
      "title": "Theme 11 - Bioinformatics and functional genomics in Sweden",
      "description": "During the second half of the third schoolyear, you can choose to go abroad and study at a foreign University, so this is what I did. I followed a course there that was about bioinformatics techniques, but also about functional genomics, so laboratory techniques. In this course we had to do two practical assignments, of which one was about something I hadn't done before: finding the function of an unknown gene/protein in the cell using different databases and techniques.",
      "id": "theme11",
      "links": [
        {
          "before": "Link to the google drive with all the documents:",
          "src": "https://drive.google.com/drive/folders/18e-pAPQrbvi4W91bNUKvTk0lpr_FTReV?usp=sharing",
          "text": "Drive",
          "after": " (opens in new tab)."
        }
      ],
      "skills": [
        "Working together",
        "Scientific writing",
        "Literary research",
        "University thinking"
      ]
    }
  ]
}
